backend/controllers/CategoryController.php

SELECT * FROM `categories`
---
    public function actionIndex() {
        $categories = Categories::find()->all();

INSERT INTO `categories` (`name`, `slug`) VALUES ('a', '123')
---
    public function actionSave() {
        $model = new Categories();
        if($model->load(Yii::$app->request->post()) && $model->validate()) {
            $request = Yii::$app->request->post();

            $model->name = $request['Categories']['name'];
            $model->slug = '123';
            $model->save();